<?php

// PHP-Matotest 
//
// http://php-matotest.sourceforge.net/
//
// PHP-Matotest is a foul-slang detector for Russian language.
// Based on Lingua::RU::Censure 0.050.01 - Perl extension for automatically
// detect deprecated russian slang, written by 
// Michael B. Babakov <M.Babakov@sochi.net.ru> and 
// Artur Penttinen <artur@niif.spb.su>.
//
// Ported to PHP by Scarab <scarab@initgroup.chat.ru>, 2002-2003.
//
// $Header: /cvsroot/php-matotest/matotest/TCensure.class.php,v 1.1.1.1 2003/05/12 15:16:46 iscarab Exp $


class TCensure {

    var $foulcore, $fouldata, $excludescore, $excludesdata;
    var $badphrases;
    
    var $rule = "", $word = "", $phrase = "";
    var $status;

    // Pointer to the constructor - used to make a constructor
    // available for inheritance
    function TCensure() {
	TCensure::Constructor();
    }

    // Setting locale and preloading data
    function Constructor() {
//	setlocale("LC_ALL", "ru_RU.KOI8-R");	// Setting locale
	$this->_LoadData(); 			// Loading data
    }

    // Checks that phrase is correct
    function CheckPhrase($phrase) {
	unset($this->phrase);
	if ($phrase) { $this->phrase = $phrase; }
	$words = $this->_Prepare();		// Preparing phrase for checking

	// Checking each word in phrase, if found any foul word,
	//  we think that all phrase is bad
	if (is_array($words)) {
	    foreach($words as $word) {
		$this->word = $word;
		if (!$this->CheckWord()) { return(false); }
	    }
	}
	
	return(true);
    }

    function CheckWord($word = "") {
	if ($word) { $this->word = $word; }
	
	$this->word = $this->_PrepareWord($this->word);

	$this->status = true; // We are considering with presumption of innocence :)
	$fl = substr($this->word, 0, 1); // fl is the first letter - it is using to search rules by index later.

	// Accusing
	if ($this->status) { $this->_CheckRegexps($this->foulcore, true); }
	if ($this->status) { $this->_CheckRegexps($this->fouldata[$fl], true); }
	if ($this->status) { $this->_CheckRegexps($this->badphrases, true); }
	
	// Trying to appeal
	if (!$this->status) { $this->_CheckRegexps($this->excludescore, false); }
	if (!$this->status) { $this->_CheckRegexps($this->excludesdata[$fl], false); }
	
	return($this->status);
    }

    function GetRule() {
	return($this->rule);
    }
    
    function GetWord() {
	return($this->word);
    }
	
    // Preparing the phrase for processing
    function _Prepare() {

	$phrase = $this->phrase;
	
	// Processing punctuation
	$phrase = preg_replace("/[\"\-\+\;\.\,\*\?\(\)]/", "", $phrase);
	$phrase = preg_replace("/[\!\:\_]/", " ", $phrase);

	// Splitting phrase by words
	unset($buffer);
	$words = explode(" ", $phrase);
	if (!is_array($words)) { return; }

	// If the word is bigger than 3 symbols or it is a preposition,
	// we adding it as is. In another case we merging it. It is need
	// to find fouls written with spaces or some punctuations between
	// the letters.	
	foreach ($words as $word) {
	    if ((strlen($word)<3) and (!preg_match("/(а[х]?)|(в)|([вмт]ы)|(д[ао])|(же)|(за)/", $word))) { $buffer .= $word; }
	    else {
		if ($buffer) { $out[] = $buffer; $buffer = ""; }
		$out[] = $word;
	    }
	}
	if ($buffer) { $out[] = $buffer; }
	return($out);
    }
    
    function _PrepareWord($word = "") {
    
	if (!$word) { $word = $this->word; }
    
	$word = strtolower($word);	// word must be in lower case
	$word = rtrim($word);	// Trimming
	
	// Processing similar letters
	$word = preg_replace("/&[Ee][Uu][Mm][Ll];/", "е", $word); // &euml processing
	$word = preg_replace("/&#203;/", "е", $word); // 203 code processing
	$word = preg_replace("/&[Cc][Ee][Nn][Tt];/", "с", $word); // "&cent" processing
	$word = preg_replace("/&#162;/", "с", $word); // 162 code processing
	$word = preg_replace("/&#120;/", "х", $word); // 120 code processing
	$word = preg_replace("/&#121;/", "у", $word); // 121 code processing
	$word = preg_replace("/\|\/\|/", "и", $word); // |/| as »

	$word = strtr($word, "gcxyaeopkhbtmnu", "дсхуаеоркнвтмпи");
	$word = strtr($word, "036", "озб");
	$word = strtr($word, "Єdiz", "едиз");

	// Processing jokes with letter-named numbers
	$word = preg_replace("/3[\.\,]14[\d]{0,}/", "пи", $word); // "3.14 as pi" processing
	$word = preg_replace("/2[\.\,]72/", "е", $word); // "2.72" as "e" processing

	// Processing punctuation
	$word = preg_replace("/[\"\-\+\;\.\,\*\?\(\)]/", "", $word);
	$word = preg_replace("/[\!\:\_]/", " ", $word);

	// Processing duplicates
	unset($post); 	// Temporary variable to keep difference of pre- and post-processed values
	while($word != $post) {
	    $post = $word;
	    $word = preg_replace("/(.)\\1\\1/", "\\1\\1", $word);
	}

	return($word);

    }
        
    function _CheckRegexps($regexps, $accuse) {
	if (!is_array($regexps)) { return; }
	foreach ($regexps as $regexp) {
	    if (preg_match("/".$regexp."/", $this->word)) {
		$this->rule = $regexp;
		if ($accuse) { $this->status = false; } else { $this->status = true; }
		break;
	    }
	}
    }
    
    function _LoadData() {
    	$this->excludesdata = array(
	"а" => array(
			    "автомоб",
			    "амеб",
			    "амудар",
			    "ансамбл",
			    "ансибл",
			    "архиманд",
			    "атрибут",
			    "аспид",
			    "ахнет",
			    "ахнул",
			    "ахтуб"
		    ),
	"б"=> array(
				"(бал[#]?)",
				"бебел",
				"бедр",
				"белибер",
				"бермуд",
				"блюхер",
				"бл€мб",
				"бл€пан[н]?",
				"бл€ронс",
				"бл€х[аеиу]?\$",
				"бл€хо(?!([мпс]))",
				"бл€ха[йю]",
				"бл€ше",
				"бл€шк",
				"богохул",
				"боскреб",
				"бронеб",
				"(бу[#]?)(бу[#]?)+",
				"быстро"
		    ),
	"в" => array(
				"веб",
				"вебер",
				"веб.?об",
				"вебсер",
				"вебстер",
				"верх",
				"вдребез",
				"вздох",
				"влюбл€",
				"волшеб",
				"востреб",
				"враждеб",
				"врачеб",
				"вроде",
				"все.?\$",
				"все[#]?т[ао]",
				"встрепан",
				"всуху",
				"втиху",
				"выгреб",
				"вытр€х",
				"выхлеб"
		    ),
	"г" => array(
				"гербарий",
				"гибел",
				"гидро[кт]",
				"где.+нибу",
				"глеб",
				"гомеоп",
				"голов",
				"горох",
				"граб",
				"гре[#]?б[еклноуш€]",
				"гриб"
		    ),
	"д" => array(
				"две",
				"дебаркад",
				"деб[еи]л",
				"дебет",
				"дебош",
				"деба[г|ж]",
				"дезокси",
				"дер€бну",
				"дирижаб",
				"дох[л|н]",
				"дребед",
				"дротик",
				"дрыхн",
				"дубл€"
		    ),
	"е" => array(
				"евпатори",
				"еле-еле",
				"епан[н]?ч",
				"епарх"
		    ),
	"ж" => array(
				"жебы",
				"ж[е|и]реб",
				"жили?",
				"жулеб"
		    ),
	"з" => array(
				"завихрен",
				"загиб",
				"заглубл€",
				"загреб[ану]?",
				"задолбил",
				"за[дс]ох",
				"заколеб",
				"закрепл",
				"залупил\$",
				"залупит",
				"замах",
				"зашиб",
				"зеб[ру]",
				"злоупотребл€",
				"з€б"
		    ),
	"и" => array(
				"избал",
				"изгиб",
				"икебан",
				"имбеци",
				"иметь",
				"инкассат",
				"(ипат\$)|(ипат((и)|(у)|(о)))",
				"испан",
				"испар",
				"истреб",
				"исчерп",
				"их[#]?\$"
		    ),
	"к" => array(
				"кабел",
				"как..-т[ао]",
				"как..-[лн]и[бк]",
				"кан[н]?[еи]бал",
				"кипуч",
				"клебанов",
				"клеп",
				"кобел",
				"ков((ре)|(ер))",
				"колеб",
				"коктебе",
				"констеб",
				"корабл€",
				"кракоз€б",
				"крик",
				"куй\$",
				"купидон",
				"кухн"
		    ),
	"л" => array(
				"ламборд",
				"лапидар",
				"либер",
				"липидо",
				"липуч",
				"лихую"
		    ),
	"м" => array(
				"м-да",
				"мандари",
				"мандат(?!(в))",
				"^мандел((а)|(ой))\$",
				"мандоли",
				"м[ао]хер",
				"мебел",
				"муданьцз€н",
				"мудехары",
				"мыши"
		    ),
	"н" => array(
				"нагреб",
				"наибол",
				"наибыс",
				"наколеб",
				"напереб",
				"нахмурил",
				"на€бед",
				"неблаг",
				"небы",
				"неплох",
				"нет\$",
				"нибу[дт]",
				"новосиб",
				"нотебук",
				"но€бр"
		    ),
	"о" => array(
				"обд[и|е]р",	
				"обл€па[лн]",
				"обсох",
				"обт€г",
				"оглобл",
				"одномандат",
				"озлобл€",
				"окт€бр",
				"опозд",
				"оскорбл",
				"ослабл",
				"отдохн",
				"отребье",
				"отсеб€",
				"отскреб",
				"отхлеб",
				"отчебуч",
				"охи[#]?((вз)|(ах))",
				"охудеп",
				"ошиб"
		    ),
	"п" => array(
				"парикмахер",
				"пасиб",
				"пассат",
				"пахн[еу]",
				"пахуч",
				"педагог",
				"педал",
				"педант",
				"педераст",
				"педолог",
				"педофил",
				"педро\$",
				"переб[еиор]",
				"перебло",
				"перемудр",
				"перепал",
				"пидопригор",
				"пистол",
				"пищеблок",
				"пихнул",
				"плебисц",
				"плебс",
				"плох[ио]",
				"пл€т(!(ь))",
				"по[#]?бабь",
				"п[р]?одебош",
				"поб[ае]р",
				"побыст",
				"погиб",
				"погреб",
				"подгреб",
				"подсобл€",
				"подох",
				"поколеб",
				"поперх",
				"попух",
				"потре[бп]",
				"похи[тщ]",
				"похлеб",
				"поху[дж]",
				"пошле",
				"пребел",
				"пр[еи]б[аы]в",
				"пребол",
				"препин",
				"прибаут",
				"прибе",
				"приб[иы][лт]",
				"прибли[жз]",
				"прибо[ейр€]",
				"прибра",
				"припизднюват",
				"приспособл€",
				"проз€б",
				"протреп",
				"протух",
				"прошиб",
				"прохуд",
				"п€тибал"
		    ),
	"р" => array(
				"равнобедр",
				"разгиб",
				"разгреб",
				"раздробл€т",
				"рас[с]?лабл€",
				"растреп",
				"расхлеб",
				"расшиб",
				"ребе\$",
				"ребен",
				"ребер",
				"ребло",
				"ребр",
				"ребу[ст]",
				"реб€",
				"ренессанс",
				"репин",
				"рибосом",
				"розет",
				"ру[#]?бл€",
				"р€бина"
		    ),
	"с" => array(
				"(сабл€\$)|(сабл€(!(к)))|(сабл[ие])",
				"салат",
				"сбербан",
				"свадеб",
				"свирепст",
				"сгреб",
				"себ",
				"сент€бр",
				"сердце",
				"серебр",
				"сиб",
				"скипидар",
				"скобл€",
				"скопид",
				"скреб",
				"скрипуч",
				"смахи",
				"служеб",
				"(спид[а]?\$)|(спидо)",
				"соскобл€",
				"спасиб",
				"ссутул",
				"стеб",
				"стебл[е€]",
				"степа",
				"стибрит",
				"стриптизбар",
				"судеб",
				"сукачев",
				"сшиб"
		    ),
	"т" => array(
				"талмуд",
				"тво€[#]?\$",
				"телепат",
				"тереб",
				"тибер",
				"типун",
				"торпед",
				"треба\$",
				"треб((у)|(ов))",
				"трепа((нг)|([лт]))",
				"трибун"
		    ),
	"у" => array(
				"убил",
				"углуб",
				"^уед",
				"^уеха",
				"уже",
				"уподоб",
				"упорхн",
				"употреб",
				"усугуб",
				"ух[ао]йд[ао]к",
				"учеб"
		    ),
	"ф" => array(
				"фидо(?!(ра))",
				"фламанд",
				"фон"
		    ),
	"э" => array(
				"эберт",
				"эби.?нур",
				"эбнер",
				"эбонит",
				"экебан",
				"эпистал",
				"эреб",
		    ),
	"х" => array(
				"хайдфил",
				"херберт",
				"херес",
				"херомант",
				"херсон",
				"херувим",
				"хлеб",
				"хли[вф]кие",
				"хмур",
				"хот€бы",
				"хреб[ет]",
				"хреновый",
				"хубер",
				"худо",
				"худе[лт]",
				"худющ",
				"худ€к",
				"хуже",
				"хуизху",
				"хулиган",
				"хули[ло]",
				"хулит(?!(ол))",
				"хунвеэбин"
		    ),
	"ц" => array(
				"целебн",
				"церебрал"
		    ),
	"ч" => array(
				"чебок",
				"чебур"
		    ),
	"ш" => array(
				"шебурш",
				"шиб",
				"шле",
				"штуч",
				"шумахер"
		    ),
	"щ" => array(
				"щебе[нт]",
				"щедрот",
				"щелбан"
		    ),

	"ю" => array(
				"ютитс"
		    ),
	"€" => array(
				"€бло[кнч]",
				"€стреб"
		    )
	);

	$this->excludescore = array(
	    "боле"	=>	"боле",
	    "гре#1"	=>	"^.{0,3}гре[#]?б\$",
	    "гре#2"	=>	"^.{0,3}гре[#]?б[аеклноуш€]",
	    "страх"	=>	"(стра[#]?ху(?!([еи])))|(^((за)|(пере)|(под))стра[#]?ху€\$)|(^((за)|(пере)|(под))стра[#]?хуй((те(с.)?)|(с€))?\$)|(^((за)|(пере)|(под))стра[#]?хуем(с€)?\$)",
	    "команд"	=>	"команд",
	    "мандат"	=>	"мандат(?!(в))",
	    "неб"	=>	"неб[еиоу]",
	    "пасиб"	=>	"пасиб",
	    "псих"	=>	"психу",
	    "теб"	=>	"[с|т][е|и]б",
	    "хлеб"	=>	"^.{0,3}хлеб",
	    "хули"	=>	"хулиган(?!(х))",
	    "шлеп"	=>	"шлеп",
	    "штрих"	=>	"штри[#]?ху"
	);

    	$this->foulcore = array(
    	    "бзд"		=> "бзд",
	    "бл€"		=> "(б[\#+еи]?л[у\#+]?€)|(б[\#+]€)|(блиад)|(бл[еи]д[иу])|([кю]л€д)|([бп][и]?л[а€][дт]ь\$)|(билат.?\$)|(блдс)",
	    "гондон"		=> "г[ао]нд[ао][ен]",
	    "долб"		=> "(д[ао]лб[ао]д€)|(д[ао]л[бп][ао]манд)|(д[ао](д[ао])?лб[ао]л[еи€]х)|(((д[ао])|(об))д[ао]лб[ао]н)",
	    "дроч"		=> "(др[ою][ктч])|(драчис)",
	    "еб#1"		=> "(^е[\#+]?[бп][а]?\$)|([\#+еиэ][\#+б][аеиу][лнктрщчм])|(е.?[\#+бп][аы][лнрт])|([еи][\#+б]авш)|(еб[ст]ел)|(^еб€т)",
	    "еб#2"		=> "(ебну)|([еи][\#+б][ыу]р)|([(орж)|(от)|(по)|(под)|(при)|(про)|(раз)|(рас)|(у)][\#+ъь]?[\#+ие]б)|(е[\#+б][лносуц])|(е.?[\#+бп][аы]мат)",
	    "еб#3"		=> "(в.?[е€]б+)|(.а[\#+ъь]?[\#+еи€][\#+б])|([\#+еи€][\#+б]в)|(п[ао]д[\#+ьъ][\#+е]б)|(^еб€\$)|(27[\\d]*.?.?ба)",
	    "еб#4"		=> "(йо[б])|(епин)|(епст)|([\#+еи][\#+п]у[нч])|(((твою)|(теб€))еб)|(ибиом)|(^ебт.\$)|(вы[е€]вы)|((вы)?йаб)",
	    "жоп"		=> "(ж[\#+ео]п)",
	    "залуп"		=> "залуп",
	    "муда"		=> "(м[\#+\у]д[аеиоюы€нл\#])|(.удозв)|(мудвин)|(мудчи)|(м[\#+у]драк)|(\#удак)",
	    "манда"		=> "(м[аоу]нд[аео€])|(манд[иуыю])|(мндо)|(мандр[еию])",
	    "л€дс"		=> "л€дс",
	    "падл"		=> "(падл[аоыю])|(пипид)",
	    "перд"		=> "([^су]перн((у)|(ет)))|(выпер[дж])|(пердан)|(^перд\$)|(перд[е€][жлнт])|(перд[и€][млтщ])|(пердн[еу])|(перд((ли)|(ол)|(у)))|(перд[ью])|(пердо\$)|([^су]п[еи]рну)",
	    "пидар"		=> "([бп][\#еиы]?д[аеио]?р)|(п[еи€]д[ао]г)|(педик)|(пидеатр)|([гф][еи]д[ео]рас)|(пудура)|(п[еи]т[ае]рас)",
	    "пизд#1"		=> "(п[ийы]?[с]?[жзс][дж])|(п[еи€][зс]?[ьъ]?д[ао])|(пист[ае])|(пи[тд]за)|(пизта)|(п[\#+]?[еи][\#+]?[зс][\#+]?д)|(кизд)|(капец)|(звезди)|(физд[еи])",
	    "пизд#2"		=> "(п[\\w]?[сз]д[ао][бт])|(пивд)|(пиз((ад)|(оп)))|(пита\$)|(бл[ею]зд)|(ф[л]?[ею]зд)|(пиз[еу][днц])|(приздроп)|(з14[\\d]*.?.?[з]?д[аеы])|(п[еи]рзд)",
	    "сран"		=> "(сран[н]?[адекоыь])|(сра[лч]ь?)|(срать)|(срет.?(с€)?\$)|(^сри\$)|(^сру\$)|(срун)|(срут)|(^срю\$)|(((об)|(под))сер[еи]в)|(сраст)|(сраты)",
	    "сать"		=> "(^сс?ать)|(ссат)|(^ссу\$)|(ссут)|(^ссы\$)|(^сс?ыку)|(^ссыте?\$)|(^ссыш)|(ссан)|(((обо)|(пере)|(недо))сс?а[лт])",
	    "хуй#1"		=> "(х.?у[^д€]?[еийыю€])|(х[\#]+)\$|(^[мх][\-у\#+][\-у\#+]?[еийыю€])|(х[у\#+][у\#+]?л[еиь€])|(^а[\#+]?ху\$)|(ахай)",
	    "хуй#2"		=> "(^а[\#+]?ху\$)|(ахай)|(х[о]й[дл])|(куй)|(м[\#+у]йн€)|(х[\#+]+н[ею€])|(х[\#+][ею€])|(^[\#+]+у[еийыю€])",
	    "член"		=> "члено((вид)|(воз)|(вре)|(гл)|(мет)|(ног)|(прием)|(сос)|(под))",
	    "€пуч"		=> "€п[п]?уч"
	);


	$this->fouldata = array(
	    "а" => array(
				"^абанамат",
				"^анахну",
				"^архипиздрит",
				"^аст[ао]еб",
				"^аст[ао]п[еи]зд",
				"^аст[ао]хер",
				"^атасас",
				"^ат[\#+ъь]?[е€]б"
			),
	    "б" => array(
				"^бабоеб",
				"^басран",
				"^батьс€",
				"^бзд",
				"^бзжу",
				"^блев[ао]",
				"^блюдов",
				"^блюзд",
				"^б[еи]л[еи]ат",
				"^блежник",
				"^бль€",
			),
	    "в" => array(
				"^вафлезл[ао]",
				"^великодрюч",
				"^взбзд",
				"^вз[\#+ъь]еб",
				"^висл[ао]хеу",
				"^влагопр[о]?еб",
				"^влагопр[ао]",
				"^восьмипроеб",
				"^вп[еи]рдол",
				"^впендюр",
				"^врот.?[еи\#+][\#+б]",
				"^вротзапил",
				"^вротскреб",
				"^выдрюч",
				"^выбл[еию]",
				"^выйобыв",
				"^выеть",
				"^выешкив",
				"^вып[еи]здр",
				"^выпенд[ю]?р",
				"^выподв",
				"^высерусь",
				"^высира",
				"^высра",
				"^высса",
				"^выссу"
			),
	    "г" => array(
				"^г[ао][вм]н",
				"^гвоздедроч",
				"^гноильн",
				"^говен",
				"^говешка",
				"^гомик",
				"^гомино",
				"^гомосек[\\w]{0,2}\$",
				"^гонолуп",
				"^гребзд",
				"^греб[ао]н",
			),
	    "д" => array(
				"^данунах",
				"^двужоп",
				"^дермо",
				"^дерьм",
				"^д[еи]бил",
				"^д[еи]б[еи]дозуб",
				"^длиннохер",
				"^д[ао]лбое",
				"^д[ао]пи[зж]",
				"^дрисн",
				"^дрисс",
				"^дрист",
				"^дрищ",
				"^дрочена",
				"^дрочан",
				"^дрочи[лтш]",
				"^дроч[ук]",
				"^дрочк",
				"^д[ао][е€]б",
				"^домохнот",
				"^д[ао]лб[ао]д€",
				"^д[ао]л[бп][ао]манд",
				"^д[ао](д[ао])?лб[ао]л[еи€]х",
				"^д[ао]д[ао]лб[ао]н",
				"^додр[ою]ч",
				"^дыдл"
			),
	    "е" => array(
				"^е[\#+][\#+]?т",
				"^е[бп]аши",
				"^е[бп]е[нмтц]",
				"^е[бп]т[ивы]",
				"^еби(?!(зне))",
				"^е[бп]ки",
				"^е[бп]твою",
				"^е[бп][с]?тит",
				"^едрит",
				"^ездец",
				"^елб",
				"^елд",
				"^еп[е]?рн",
				"^епрст\$",
				"^ептать\$",
				"^епт[аю]\$",
				"^(?<!(им))еть",
				"^ехнут"
			),
	    "ж" => array(
				"^жмуд",
			),
	    "з" => array(
				"^заблева",
				"^заговн€ть",
				"^задристать",
				"^задышк",
				"^заелдон",
				"^заеп[п]?ен",
				"^заеть",
				"^зажоп",
				"^з[ао]луп",
				"^заман((ал)|(дюк))",
				"^замуда",
				"^замудоха",
				"^занафу€ч",
				"^заныка[лт]",
				"^зап[еи]ж",
				"^зап[еи]ндюр",
				"^зап[еи]рдун",
				"^запипи",
				"^записьк",
				"^заподл",
				"^запроеб",
				"^засер",
				"^засир",
				"^засобачи[лт]",
				"^застебан",
				"^засса",
				"^зас[с]?ыха\$",
				"^заторчал",
				"^зав[ао]фл",
				"^защекан",
				"^захера",
				"^зв[еи]здобол",
				"^зв[еи]здун",
				"^здец",
				"^звизд",
				"^зл[ао][бп][ао]е[бп]",
				"^зл[ао][€е]б",
				"^злоп[ао]х",
			),
	    "и" => array(
				"^и.?[бп]а[лнрт]",
				"^и.?[бп]аши",
				"^и.?[бп]е[нмтц]",
				"^изговн",
				"^издец",
				"^ипа[ц]+а",
				"^итит([\#+ъь]?)|(!(с))",
				"^их[еи]бут"
			),
	    "й" => array(
				"^йобан",
			),
	    "к" => array(
				"^кабзд",
				"^калоед",
				"^квазиуеб",
				"^кизди[тш]",
				"^кл€пыжит",
				"^к[ао]бзд",
				"^к[ао]зл[ао]еб",
				"^к[ао]лд[ао]еб",
				"^к[ао]лдыр",
				"^к[ао]н[ао]еб",
				"^кебени",
				"^к[еи]рд[еы][кц]",
				"^кисец",
				"^коз.бл",
				"^косозалуп",
				"^коца[нт]",
				"^кр[ао]к[ао]еб",
				"^красн[ао]жоп",
				"^крендец",
				"^ку€кнул"
			),
	    "л" => array(
				"^лжеб",
				"^лихолох",
				"^л€рв"
			),
	    "м" => array(
				"^ма[вз][аео].?фак",
				"^м[ао]л[ао]ф",
				"^манд[\#+а]\$",
				"^м[ао]нд[ао][в]",
				"^мандакрыл",
				"^мандар[ао]еб",
				"^м[ао]нде[йрт]",
				"^манди[лтщ]?(?!(р))",
				"^мдак",
				"^междужоп",
				"^мндр[оу]",
				"^м[ао]ндатн€",
				"^манд[уыю]",
				"^матоеб",
				"^матозад",
				"^мин[\#+ъь]?ет",
				"^мобсел",
				"^мозгоеб",
				"^мозгопроеб",
				"^мокрощ[еи]лк",
				"^моноп[еи]н[еи]с",
				"^мохно((нед)|(муд))",
				"^м[ао]шонк[ао][ао]?б",
				"^мундел",
				"^му€чеч"
			),
	    "н" => array(
				"^набзде[лт]",
				"^наговн€",
				"^надр[иы]с",
				"^надр[ою]ч",
				"^надр€мс",
				"^назалуп",
				"^намандаш",
				"^напизд",
				"^насал",
				"^насса",
				"^насца",
				"^нах\$",
				"^нах[пу]",
				"^нахеза",
				"^нахер",
				"^нахуа\$",
				"^на[\#+ц]уй",
				"^нед[ао][е€]б",
				"^нед[ао]пи[зж]",
				"^неуе[\#+б]+",
				"^нечленосос"
			),
	    "о" => array(
				"^обдриста",
				"^обл[еи]м[ао]нд",
				"^обл[еи]муд",
				"^обосца",
				"^обсир",
				"^обспускан",
				"^обуевш",
				"^огрохув",
				"^окуел",
				"^опр[ао]муд",
				"^опрст\$",
				"^ост[ао]хер",
				"^отдрюч",
				"^отмудоха",
				"^отпиз",
				"^отсоси\$",
				"^отчермуто",
				"^отъеть",
				"^офоршмачи",
				"^офуен[н]?",
				"^ох[еу]жоп",
				"^охумев",
				"^охулк",
				"^ох[еу]ндрот",
				"^ох[еу]р",
				"^ошмудок"
			),
	    "п" => array(
				"^педри[лк]",
				"^пендюр",
				"^пере[е]?б[алд]",
				"^пере[е]?б[ал]",
				"^передрен",
				"^перевзб",
				"^пер[е]?колд",
				"^перекосоеб",
				"^перемат",
				"^перемуд",
				"^перепизну",
				"^пересуч",
				"^перетит",
				"^перехер",
				"^пердлов",
				"^пернет",
				"^перну[влт]",
				"^п[еи][сз]ж",
				"^пиндос",
				"^пипе[т]?ц",
				"^пи[пс]ис",
				"^писк.\$",
				"^пист(([\#+ъью])|(?!(он)))",
				"^питишка\$",
				"^плеха\$",
				"^плыва\$",
				"^п[ао]бл[еи]ден",
				"^п[ао]бл[и€]душ",
				"^подвзб",
				"^подговн",
				"^подзабор",
				"^подзл[ао]еб",
				"^подлоеб",
				"^подре[й]?туз",
				"^подроч[иу]",
				"^под[\#+ъь]еб",
				"^подстр[ао]хер",
				"^поеть",
				"^полуеб",
				"^полужоп",
				"^попоеб",
				"^поср[ае]т",
				"^посру",
				"^посс[ауы]",
				"^похер",
				"^похух",
				"^пох[\#+ъь]е",
				"^поц[ау]?\$",
				"^поцоват",
				"^припизд",
				"^произ[\#+ъь]?еб",
				"^пр[ао]х[ао]еб",
				"^пр[еи]здун",
				"^пр[еиу]м[ао]нд[ао]",
				"^прилабун",
				"^прозалуп",
				"^пром[ао]нд",
				"^промуд",
				"^пр[ао]п[еиу]рд((ы)|([ао]м[ао]нд[ао]))",
				"^пр[ао]с[с]?уч",
				"^пр[ао]шм[ао]нд",
				"^пр[ао]х.блу",
				"^приебо",
				"^пропизд",
				"^пучезад"
			),
	    "р" => array(
				"^р[ао][зс][\#+ъь]?е[бпт]",
				"^рах[\#+ъь]?ед",
				"^ра[зс]долба[еий]",
				"^ра[зс]долбое",
				"^ра[зс]дрю",
				"^ра[зс]простоеб",
				"^ра[зс]пидз",
				"^ра[зс]проеб",
				"^ра[зс]проет",
				"^ра[зс]пронаедр",
				"^ра[зс][с]?теб",
				"^ра[зс]тр[еи]кв",
				"^ра[зс]тыка",
				"^ра[зс]членх",
				"^р[ау][зс]туд[иы]т",
				"^расп[ао]хаб",
				"^распроторазд"
			),
	    "с" => array(
				"^сака",
				"^самоеб",
				"^сахер",
				"^свином[ао]нд",
				"^сговн€",
				"^секел",
				"^семироеб",
				"^серепер",
				"^серун",
				"^серька",
				"^сест[\\w]?[ао]еб",
				"^сика",
				"^сикат",
				"^сикел",
				"^сипов",
				"^сирать",
				"^сирывать",
				"^ском[м]?унизд",
				"^скурви",
				"^скурех",
				"^скуре€",
				"^скур€г",
				"^скур€ж",
				"^сосомол",
				"^состать\$",
				"^спермот[ао]в[ао]з",
				"^спиж",
				"^спизд",
				"^срак\$",
				"^срак[ауо]",
				"^сруль",
				"^ссака",
				"^ссаки",
				"^ссан[н]?о",
				"^струк\$",
				"^[с]?суче((х)|(нок))",
				"^[с]?суч[к]?ар",
				"^[с]?суч((ий)|(ка))",
				"^суперзаеб",
				"^сухобзд",
				"^суходроч",
				"^сцавинье",
				"^сц[аиы]к[аиу]",
				"^сцание",
				"^сцать",
				"^сциха",
				"^сцуль",
				"^сцыха",
				"^с[\#+ъь]еб",
				"^сыкун"
			),
	    "т" => array(
				"^тарачлен",
				"^твоюмат",
				"^трандец\$",
				"^триквант",
				"^трим[ао]н[ао]?д",
				"^троедром",
				"^троедруч",
				"^тринитроеб",
				"^трипиз[ао][бп]лд",
				"^трипробзд",
				"^трих[ао]м[ао]н[ао]?д",
				"^троедолбо",
				"^трындоп[еи]нд",
				"^туебен"
			),
	    "у" => array(
				"^ублюд",
				"^угреб[и]",
				"^угробищ",
				"^уеть",
				"^ум[аоу]дох",
				"^упизд",
				"^усса[лт]",
				"^уссыш",
				"^усцатьс€"
			),
	    "ф" => array(
				"^факин",
				"^факну",
				"^факуд",
				"^факошит",
				"^фидераст",
				"^фопа",
				"^фуй\$",
				"^фуцк"
			),
	    "х" => array(
				"^хезать",
				"^хер",
				"^хера",
				"^хере",
				"^херн[еи€ю]",
				"^х[еи]ров",
				"^хером",
				"^хитрожоп",
				"^хитрозад",
				"^хлабал",
				"^хлюха",
				"^хуканут",
				"^хурл",
				"^хуров"
			),
	    "ч" => array(
				"^черебзд",
				"^чернож[ео]п",
				"^чикс.",
				"^чмо\$",
				"^чмыр[еь€]",
				"^член€р"
			),
	    "ш" => array(
				"^шваль",
				"^швинд",
				"^шизд[ао]х",
			),
	    "э" => array(
				"^э[бп]а[лнрт]",
				"^э[бп]аши",
				"^э[бп]е[нмтц]",
				"^эб[илносуц]",
			),
	    "ю" => array(
				"^юхан"
			),
	    "€" => array(
				"^€.?[бп]а[лнрт]",
				"^€.?[бп]аши",
				"^€.?[бп]е[нмтц]",
				"^€б[илносуц]",
				"^€[бп]тв",
				"^€пу",
				"^€лд[аоу]"
			)
	);
    

	$this->badphrases = array(
		"анепош[е]?л[и]?бы[вт]ы",
		"еханыйбабай",
		"идинахуй",
		"редк..педальност",
		"сучийпотрох",
		"тык[ао]зел",
		"теб€имел[аи]?(?!(ввид))",
		"имел[аи]?теб€(?!(ввид))",
		"отс[ао]сатьу",
		"отс[ао]сичлен",
	);
    
    }
}

?>
